{"data":{"markdownRemark":{"html":"<p>I am a full-stack software engineer currently at <a href=\"https://www.audible.com/\">Audible</a>. Before that, I was at <a href=\"https://www.spotify.com/\">Spotify</a> for six and a half years, which came after a few years at a small digital agency called <a href=\"https://sanbornagency.com/\">Sanborn Media Factory</a>, which came after the first time I was ever paid to program, at <a href=\"https://www.teachforamerica.org/\">Teach For America</a>. Before that I was working temp jobs and going to grad school and wondering if moving to NYC \"just to see what it was like\" had been such a great plan after all. But it worked out, so the answer is \"yes.\"</p>\n<p>My roots are in the front end, but I spend a fair bit of time working with database, servers, back end APIs, and other server-side components. I've found that delivering a good user experience means making sure all technical decisions are grounded in serving user intent. Does the UI do a good job letting the user know what's possible, and capture the user's intentions? Does the API allow for properly modeling that intent? Does the data persistence layer provide the needed reliability, efficiency, and flexibility to store and query these models?</p>\n<p>Collaborative. Mentor. Support. Deliver, but help others. If I deliver on time that's one developer delivering one thing. If I take the time to help out my colleagues, that's multiple able to work at a higher level.</p>\n<p>Enjoy working with data.</p>\n<p>Care about infrastructure and developer experience.</p>\n<p>A few things I'm excited about currently:</p>\n<ul>\n<li>graphql</li>\n<li>functional programming</li>\n</ul>\n<p>things I want to learn this year:</p>\n<ul>\n<li>elixir</li>\n<li>typescript</li>\n<li>yesod</li>\n<li>maybe rust</li>\n<li>vue</li>\n<li>kotlin</li>\n<li>graph databases</li>\n</ul>\n<p>Strong opinions, loosely held.</p>\n<p>Things I work with:</p>\n<ul>\n<li>java</li>\n</ul>\n<p>Things I like:</p>\n<ul>\n<li>postgres</li>\n<li>python</li>\n<li>java</li>\n<li>docker</li>\n</ul>","frontmatter":{"date":"January 13, 2018","path":"/posts/about","title":"About"}}},"pageContext":{}}