{"data":{"markdownRemark":{"html":"<p>The inspiration for my username is the Pixar film <a href=\"https://en.wikipedia.org/wiki/Ratatouille_(film)\">Ratatouille</a>, a story about rat named Remy with a passion for cooking. Being a rat, he has a rough go of it. All his fellow rats just see food as fuel, and every human Remy encounters sees nothing but a rat. Nonetheless, Remy persists, inspired by the motto of chef Auguste Gusteau: “Anyone can cook.”</p>\n<p>In comparison, I've had it pretty easy. In the first place, being a human rather than a rat makes typing on a keyboard easier. And while a liberal arts background is less common in this field than, say, computer science, it's not <em>that</em> unusual, particularly on the web-dev end of software engineering. I supposed I could claim that I'm \"self-taught,\" but that only feels true in a very narrow sense. Between all the <a href=\"https://alistapart.com/\">List Apart</a> articles, <a href=\"https://stackoverflow.com/\">Stack Overflow</a> posts, tech meetups, books read, and colleagues I've worked with, it feels disengenous bordering on dishonest to call myself \"self-taught.\" If anything, I've had an embarrassing richness of teachers.</p>\n<p>So I'm inspired by Remy's story, but his story isn't mine. The openness that I found in the web development community when I was first starting out is markedly different than the challenges faced by a rat who wants to be a chef.</p>\n<p>And yet, is that entirely true? In many way, the software industry is remarkably open. Meritocratic, even. A computer and an internet connection is enough to get you started. Practice, study, catch a few breaks, and people will actually pay you to write code. Get decently good and they'll even pay you real money. In this era of shrinking opportunities for the middle class, software engineering stands out as having an unusually low barrier to entry. Then again, if it's really that easy to get in the door, why is it that when I look around the office I mainly see people who look a lot like, well, me?</p>\n<p>Not quite the meritocracy. The software industry is, after all, still part of human culture, with all the attendant biases and other shortcomings. When I look around the room at the office or while attending a conference, the crowd isn't exactly a representative of the world at large.</p>\n<p>But the technical barriers to entry are low. The knowledge is open and available. Time, effort, an internet connection, and a text editor, and it is possibe to learn. More time, more effort, and possible not just to learn, but to get good.</p>\n<p>At it's best..</p>\n<p>Spirit of openness.</p>\n<p>Would like to help make that open. Do my little bit to make that easier for people.</p>\n<p>Anyone can code. It's not cooking -- you can't eat it. But still fun, and sustaining and creative.</p>","frontmatter":{"date":"January 13, 2018","path":"/posts/anyonecancode","title":"Anyone Can Code?"}}},"pageContext":{}}